# Boolean1◦ Дано целое число A. Проверить истинность
# высказывания: «Число A является положительным».

# def positive_number():
#     A = int(input('Введите число: '))
#     print(A > 0)
#
# positive_number()


# Boolean10◦  Даны два целых числа: A, B.
# Проверить истинность высказывания: «Ровно одно из чисел
# A и B нечетное».


# def even_number():
#     A = int(input('Введите число A: '))
#     B = int(input('Введите число B: '))
#     print(A % 2 != 0 and B % 2 == 0 or A % 2 == 0 and B % 2 != 0)
#
# even_number()



# Boolean15◦ Даны три целых числа: A, B, C.
# Проверить истинность высказывания: «Ровно два из чисел
# A, B, C являются положительными»

# def positive_numbers():
#     A = int(input('Введите число A: '))
#     B = int(input('Введите число B: '))
#     C = int(input('Введите число C: '))
#     print(A > 0 and B > 0 or B > 0 and C > 0 or A > 0 and C > 0)
#
# positive_numbers()


# Boolean34◦ Даны координаты поля шахматной доски x, y
# (целые числа, лежащие в диапазоне 1–8). Учитывая, что левое нижнее
# поле доски (1, 1) является черным, проверить истинность
# высказывания: «Данное поле является белым»


# def white_cell():
#     x = int(input('Введите число x: '))
#     y = int(input('Введите число y: '))
#     if x % 2 != 0:
#         print(y % 2 == 0)
#     elif x % 2 == 0:
#         print(y % 2 != 0)
#
# white_cell()




